package org.example._2024_01_15;

public class CollectorsAndCollectionsTasks {

    public static void main(String[] args) {
        // Задача 1: Собрать элементы потока в список.
        // Задача 2: Удалить дубликаты из списка и собрать их в множество.
        // Задача 3: Группировка строк по длине.
        // Задача 4: Подсчет повторяющихся элементов и создание мапа.
        // Задача 5: Собрать только уникальные элементы в список.
        // Задача 6: Объединение элементов в строку с максимальной длиной.
        // Задача 7: Разбиение строки на символы и сбор их в множество.
        // Задача 8: Построение кастомной мапы из элементов.
        // Задача 9: Подсчет суммы значений объектов.
        // Задача 10: Группировка по критерию и подсчет среднего.
    }
}